Terraform plan for __dev__
<details>
  <summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_dns_record_set.ibo_redis_a_record will be created
  + resource "google_dns_record_set" "ibo_redis_a_record" {
      + id           = (known after apply)
      + managed_zone = "ebo-dev-private-dns-managed-zone"
      + name         = "ibo.redis.commerce.internal."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.inventory_redis_a_record will be destroyed
  - resource "google_dns_record_set" "inventory_redis_a_record" {
      - id           = "projects/ebo-dev-321910/managedZones/ebo-dev-private-dns-managed-zone/rrsets/inventory.redis.commerce.internal./A" -> null
      - managed_zone = "ebo-dev-private-dns-managed-zone" -> null
      - name         = "inventory.redis.commerce.internal." -> null
      - project      = "ebo-dev-321910" -> null
      - rrdatas      = [
          - "10.100.0.3",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

  # module.ibo_redis.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = false
      + auth_string              = (sensitive value)
      + authorized_network       = "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/global/networks/ebo-dev-network"
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + location_id              = (known after apply)
      + memory_size_gb           = 1
      + name                     = "ibo-redis"
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + redis_version            = "REDIS_6_x"
      + region                   = "asia-south1"
      + reserved_ip_range        = "10.100.0.0/24"
      + server_ca_certs          = (known after apply)
      + tier                     = "BASIC"
      + transit_encryption_mode  = "DISABLED"
    }

  # module.inventory_redis.google_redis_instance.cache will be destroyed
  - resource "google_redis_instance" "cache" {
      - auth_enabled             = false -> null
      - authorized_network       = "projects/ebo-dev-321910/global/networks/ebo-dev-network" -> null
      - connect_mode             = "DIRECT_PEERING" -> null
      - create_time              = "2021-09-21T08:46:08.930690002Z" -> null
      - current_location_id      = "asia-south1-a" -> null
      - host                     = "10.100.0.3" -> null
      - id                       = "projects/ebo-dev-321910/locations/asia-south1/instances/inventory-redis" -> null
      - labels                   = {} -> null
      - location_id              = "asia-south1-a" -> null
      - memory_size_gb           = 1 -> null
      - name                     = "inventory-redis" -> null
      - persistence_iam_identity = "serviceAccount:506217599260-compute@developer.gserviceaccount.com" -> null
      - port                     = 6379 -> null
      - project                  = "ebo-dev-321910" -> null
      - redis_configs            = {} -> null
      - redis_version            = "REDIS_5_0" -> null
      - region                   = "asia-south1" -> null
      - reserved_ip_range        = "10.100.0.0/24" -> null
      - server_ca_certs          = [] -> null
      - tier                     = "BASIC" -> null
      - transit_encryption_mode  = "DISABLED" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #235](https://github.com/ebomart/commerce-infrastructure/actions/runs/1311845729)